Repository: kouloucrepin/api_prune
Catalog: android_futter_apps/lib/l10n/intl_*.arb
Languages: fr

# settings_title
source: Settings
fr: Paramètres

source: Dark mode
fr: Mode sombre

source: Language
fr: Langue

# share_app
source: Share the app
fr: Partager l'application

# share_qr
source: Share QR code
fr: Partager le QR code

# about_app
source: About the app
fr: À propos de l'app

source: App version
fr: Version de l'application

# about_app_plus
source: This application was designed to automatically classify plums.
fr: Cette application a été conçue pour classifier automatiquement les prunes.

# history_analyze
source: Analysis history
fr: Historique des analyses

# no_analyse
source: No analysis recorded.
fr: Aucune analyse enregistrée.

source: Close
fr: Fermer

# help_title
source: Help & Guide
fr: Aide & Guide

source: 🚀 Quick Start
fr: 🚀 Démarrage rapide

# tip_1
source: 📱 Launch the app: the camera opens automatically.
fr: 📱 Lancez l'application : la caméra s’ouvre automatiquement.

# tip_2
source: Place a plum well-centered in the screen.
fr: Placez une prune bien au centre de l’écran.

# tip_3
source: 👌 Tap the capture button!
fr: 👌 Cliquez sur le bouton de capture !

# tip_4
source: 📊 See the automatic analysis and prediction displayed.
fr: 📊 Observez l’analyse automatique et la prédiction qui s'affiche.

# tip_5
source: 🖼️ You can also import an image from the gallery.
fr: 🖼️ Vous pouvez aussi importer une image depuis la galerie.

# photo_tips
source: 📸 Tips for better photos
fr: 📸 Astuces pour des photos réussies

# tip_6
source: 💡 Prefer natural light to avoid glare.
fr: 💡 Préférez la lumière naturelle pour éviter les reflets.

# tip_7
source: 📷 Place the plum alone and well-centered in the image.
fr: 📷 Placez la prune seule et bien centrée dans l'image.

# tip_8
source: ✋ Stay stable or use a stand for sharper images.
fr: ✋ Restez stable ou utilisez un support pour plus de netteté.

# tip_9
source: 🫐 Make sure the plum is fully visible.
fr: 🫐 Assurez-vous que la prune est bien visible et entière.

# tip_10
source: 🧽 Clean the plum if dirty for better detection.
fr: 🧽 Nettoyez la prune si elle est sale pour une meilleure détection.

# categories_title
source: Detected Plum Categories
fr: Catégories de prunes détectées

# cat_good
source: Good quality
fr: Bonne qualité

# desc_good
source: Perfect plum, spotless, firm and ready to eat.
fr: Prune parfaite, sans tache, ferme et prête à la consommation.

# cat_unripe
source: Unripe
fr: Non mûre

# desc_unripe
source: Still green and acidic. Needs time to ripen.
fr: Encore verte et acide. Elle a besoin de temps pour mûrir.

# cat_spotted
source: Spotted
fr: Tachetée

# desc_spotted
source: Superficial marks. Generally still edible.
fr: Marques superficielles. Généralement encore comestible.

# cat_cracked
source: Cracked
fr: Fissurée

# desc_cracked
source: Shows cracks due to shock or growth.
fr: Présente des fissures dues à un choc ou à la croissance.

# cat_bruised
source: Bruised
fr: Meurtrie

# desc_bruised
source: Soft or darkened areas after a fall.
fr: Zones molles ou brunies suite à une chute.

# cat_rotten
source: Rotten
fr: Pourrie

# desc_rotten
source: Mold or strong smell. Discard immediately.
fr: Moisissures ou odeur forte. À jeter immédiatement.

# processing_title
source: Processing
fr: Analyse en cours

# processing_message
source: Please wait a few seconds...
fr: Veuillez patienter quelques instants...

source: Cancel
fr: Annuler

# retry
source: Retry analysis
fr: Relancer l'analyse

# result_title
source: Result: {prediction}
fr: Resultat: {prediction}

# cancelled
source: 🔁 Analysis cancelled.
fr: 🔁 Analyse annulée.

# api_error
source: ❌ API error ({statusCode})
fr: ❌ Erreur API ({statusCode})

# no_connection
source: ❌ No Internet connection.
fr: ❌ Problème de connexion Internet.

# timeout
source: ⌛ Analysis took too long. Please try again.
fr: ⌛ Analyse trop longue. Réessaye.

# unexpected_error
source: ❗ Unexpected error: {error}
fr: ❗ Erreur inattendue : {error}

# project_title
source: 🚀 Project: PlumAnalyser
fr: 🚀 Projet : PlumAnalyser

# project_description
source: An intelligent mobile app that scans an African plum and instantly determines its condition (ripe, rotten, cracked, etc.) using a machine learning model trained and deployed online.
fr: Une application mobile intelligente qui permet de scanner une prune africaine et de déterminer instantanément son état (mûre, pourrie, fissurée, etc.) à l'aide d'un modèle de machine learning entraîné et déployé en ligne.

# technologies_title
source: 🧰 Technologies used
fr: 🧰 Technologies utilisées

# tech_cv_cnn
source: Computer Vision and CNN architecture
fr: Vision par ordinateur et architecture CNN

# team_title
source: 👨‍💻 Team members
fr: 👨‍💻 Membres de l'équipe

# footer_sub
source: Project built in 24h ⏱️
fr: Projet développé en 24h chrono ⏱️

# role_banzouzi
source: Data analysis, model evaluation, writing
fr: Analyse de données, évaluation du modèle, rédaction

# role_koulou
source: Model optimization, TensorFlow, Optuna, API deployment
fr: Optimisation du modèle, TensorFlow, Optuna, déploiement API

# role_abena
source: Mobile development, AI integration
fr: Développement mobile, Intégration IA

# role_loufouma
source: Design, computer graphics, writing
fr: Design, infographie, rédaction

# role_henoc
source: API development, TensorFlow Specialist
fr: Développement d’API, TensorFlow Specialist

# role_ngoulou
source: Engineering student, Data Scientist
fr: Élève ingénieur, Data Scientist

source: Retrying...
fr: Nouvelle tentative...
